app/controllers/books_controller.rb

  def show
  @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    if @book.save
    flash[:notice] = "Book was successfully created."
    redirect_to book_path(@book.id)
    else
      @books =Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "宅島"], ["body", "iii"], ["created_at", "2019-10-13 11:51:13.220494"], ["updated_at", "2019-10-13 11:51:13.220494"]]
SELECT "books".* FROM "books"

  def update
    book = Book.find(params[:id])
    if book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "ttt"], ["updated_at", "2019-10-13 14:06:40.802872"], ["id", 33]]